In [20]:
import numpy as np
import pandas as pd

edata = {'empId':[3,1,2,4],
        'name':['Brad','John','Dan','Thomas'],
        'supervisor':[np.nan,3,3,3],
        'salary':[4000,1000,2000,4000]}
bdata = {'empId':[2,4],
         'bonus':[500,2000]}

edata = {'empId':[3,1,2,4],
        'name':['Brad','John','Dan','Thomas'],
        'supervisor':[np.nan,3,3,3],
        'salary':[4000,1000,2000,4000]}
bdata = {'empId':[2,1,4],
         'bonus':[1000,np.nan,2000]}

employee = pd.DataFrame(edata)
bonus = pd.DataFrame(bdata)

In [21]:
mergeDF = pd.merge(employee,bonus,on='empId',how='outer')
lesstho = mergeDF[(mergeDF.bonus<1000)|(mergeDF.bonus.isnull())]
cleaned = lesstho.drop(columns=['empId','supervisor','salary'])
cleaned

   empId    name  supervisor  salary   bonus
0      1    John         3.0    1000     NaN
1      2     Dan         3.0    2000  1000.0
2      3    Brad         NaN    4000     NaN
3      4  Thomas         3.0    4000  2000.0

   name  bonus
0  John    NaN
2  Brad    NaN